;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[BOLTPISTOL_CV X2WeaponTemplate]
FriendlyName="底格里斯型爆矢手枪"
FriendlyNamePlural="底格里斯型爆矢手枪"
BriefSummary="底格里斯型爆矢手枪在铸造世界底格里斯中发现，它的STC数据在荷鲁斯叛乱之前迅速在帝国中传播。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>底格里斯型爆矢手枪在铸造世界底格里斯中发现，它的STC数据在荷鲁斯叛乱之前迅速在帝国中传播。\n<Bullet/>虽然底格里斯已经陷落，以它为命名的爆矢手枪亦无法继续生产，但是现存的底格里斯爆矢手枪仍在服役。"
AbilityDescName="爆矢手枪"

[BOLTPISTOL_MG X2WeaponTemplate]
FriendlyName="谷神星型爆矢手枪"
FriendlyNamePlural="谷神星型爆矢手枪"
BriefSummary="谷神星型爆矢手枪出自帝国海军，但在行商浪人的武器库中能够时常搜查而出。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>谷神星型爆矢手枪出自帝国海军，但在黑商的武器库中能够时常搜查而出。"
AbilityDescName="爆矢手枪"

[BOLTPISTOL_BM X2WeaponTemplate]
FriendlyName="极限型爆矢手枪"
FriendlyNamePlural="极限型爆矢手枪"
BriefSummary="已知这种型号在巴达布战争期间被星际战士战团螳螂战士和火鹰所使用。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>已知这种型号在巴达布战争期间被星际战士战团螳螂战士和火鹰所使用。"
AbilityDescName="爆矢手枪"
